biddr_api/app/controllers/api/v1/auctions_controller.rb

INSERT INTO "auctions" ("title", "description", "current_price", "bid_end_at", "reserve_price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      #current_user = User.find(19)
      auction = Auction.new(auction_params)
      auction.user = current_user
      auction.save!

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
    def index
      auctions = Auction.order(created_at: :desc)

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_auction
      @auction = Auction.find(params[:id])