biddr_api/app/controllers/api/v1/bids_controller.rb

INSERT INTO "bids" ("bid_price", "user_id", "auction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bid_price", 0], ["user_id", 7], ["auction_id", 3], ["created_at", "2022-04-20 03:50:06.212398"], ["updated_at", "2022-04-20 03:50:06.212398"]]
---
  def create
    bid = Bid.new(bid_price: params[:bid_price].to_i, auction_id: params[:auction_id])
    bid.user = current_user



    bid.save!

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_auction
    @auction = Auction.find params[:auction_id]